Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_OFF (9u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_DMEM_EN_OFF (10u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_DTAG_EN_OFF (11u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU2_PMEM_EN_OFF (12u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU2_PTAG_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU2_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU2_DLMU_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU3_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU3_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU3_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_DTAG_EN_OFF (16u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU3_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU3_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU3_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU3_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU3_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU3_PMEM_EN_OFF (17u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU3_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU3_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU3_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU3_PTAG_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU4_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU4_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU4_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU4_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU4_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU4_PTAG_EN_OFF (23u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU4_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU4_DLMU_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU4_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU4_DLMU_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU4_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU4_DLMU_EN_OFF (24u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_OFF (27u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_OFF (9u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_MSK (0x1u)

