Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MINI_MCDS_EN */
#define IFX_MTU_MEMTEST1_MINI_MCDS_EN_OFF (10u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_OFF (11u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_OFF (12u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_OFF (16u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER0_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER0_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER0_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER0_EN_OFF (17u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_BUFFER1_EN */
#define IFX_MTU_MEMTEST1_SPU_BUFFER1_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG0_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG0_EN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SPU_CONFIG1_EN */
#define IFX_MTU_MEMTEST1_SPU_CONFIG1_EN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_FIFO_EN */
#define IFX_MTU_MEMTEST1_GTM_FIFO_EN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0SLOW_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0SLOW_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0SLOW_EN_OFF (22u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS0FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS0FAST_EN_OFF (23u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1SLOW_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1SLOW_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1SLOW_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1SLOW_EN_OFF (24u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_MCS1FAST_EN */
#define IFX_MTU_MEMTEST1_GTM_MCS1FAST_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1A_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1A_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL1BC_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL1BC_EN_OFF (27u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_OFF (28u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.ETHERMAC_EN */
#define IFX_MTU_MEMTEST1_ETHERMAC_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.ETHERMAC_EN */
#define IFX_MTU_MEMTEST1_ETHERMAC_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.ETHERMAC_EN */
#define IFX_MTU_MEMTEST1_ETHERMAC_EN_OFF (29u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_MSK (0x1u)

