Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_OFF (30u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN11_EN */
#define IFX_MTU_MEMTEST1_MCAN11_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN11_EN */
#define IFX_MTU_MEMTEST1_MCAN11_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN11_EN */
#define IFX_MTU_MEMTEST1_MCAN11_EN_OFF (31u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF1_EN_OFF (3u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF1_EN_OFF (5u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF1_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF1_EN_OFF (7u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_OFF (16u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_OFF (17u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.HSPDM_RAM_EN */
#define IFX_MTU_MEMTEST2_HSPDM_RAM_EN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT00_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT00_RAM_EN_OFF (24u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT01_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT01_RAM_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT10_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT10_RAM_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT11_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT11_RAM_EN_OFF (27u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SPU_FFT20_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT20_RAM_EN_OFF (28u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SPU_FFT21_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT21_RAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SPU_FFT21_RAM_EN */
#define IFX_MTU_MEMTEST2_SPU_FFT21_RAM_EN_MSK (0x1u)

