Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_DTMAP */
#define IFX_MTU_MEMMAP_CPU4_DTMAP_OFF (21u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_OFF (22u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_OFF (23u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_OFF (25u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_OFF (26u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_PCMAP */
#define IFX_MTU_MEMMAP_CPU5_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_PCMAP */
#define IFX_MTU_MEMMAP_CPU5_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_PCMAP */
#define IFX_MTU_MEMMAP_CPU5_PCMAP_OFF (27u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_PTMAP */
#define IFX_MTU_MEMMAP_CPU5_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_PTMAP */
#define IFX_MTU_MEMMAP_CPU5_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_PTMAP */
#define IFX_MTU_MEMMAP_CPU5_PTMAP_OFF (28u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_OFF (1u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_OFF (2u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_OFF (3u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_OFF (5u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_OFF (6u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_OFF (7u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_OFF (8u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_OFF (10u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_OFF (11u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_OFF (12u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_OFF (13u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU3_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU3_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU3_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DMEM_AIU_OFF (15u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU3_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU3_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU3_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_DTAG_AIU_OFF (16u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU3_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU3_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU3_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PMEM_AIU_OFF (17u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU3_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PTAG_AIU_LEN (1u)

