Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU3_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU3_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU3_PTAG_AIU_OFF (18u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU4_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU4_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU4_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DMEM_AIU_OFF (20u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU4_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU4_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU4_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_DTAG_AIU_OFF (21u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU4_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU4_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU4_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PMEM_AIU_OFF (22u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU4_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU4_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU4_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU4_PTAG_AIU_OFF (23u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU5_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU5_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU5_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_DMEM_AIU_OFF (25u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU5_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU5_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU5_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PMEM_AIU_OFF (27u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU5_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU5_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU5_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU5_PTAG_AIU_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_OFF (1u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2PCEN */
#define IFX_MTU_MEMDONE0_CPU2PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2PCEN */
#define IFX_MTU_MEMDONE0_CPU2PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2PCEN */
#define IFX_MTU_MEMDONE0_CPU2PCEN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DMEM_DONE_OFF (5u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DTAG_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PMEM_DONE_OFF (7u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU1_PTAG_DONE_OFF (8u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1_DLMU_STBY_DONE */
#define IFX_MTU_MEMDONE0_CPU1_DLMU_STBY_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DMEM_DONE_OFF (10u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DTAG_DONE_OFF (11u)

