Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0PCEN */
#define IFX_MTU_MEMDONE0_CPU0PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0PCEN */
#define IFX_MTU_MEMDONE0_CPU0PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0PCEN */
#define IFX_MTU_MEMDONE0_CPU0PCEN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1PCEN */
#define IFX_MTU_MEMDONE0_CPU1PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1PCEN */
#define IFX_MTU_MEMDONE0_CPU1PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1PCEN */
#define IFX_MTU_MEMDONE0_CPU1PCEN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1PSEN */
#define IFX_MTU_MEMDONE0_CPU1PSEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1PSEN */
#define IFX_MTU_MEMDONE0_CPU1PSEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1PSEN */
#define IFX_MTU_MEMDONE0_CPU1PSEN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU1PTEN */
#define IFX_MTU_MEMDONE0_CPU1PTEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU1PTEN */
#define IFX_MTU_MEMDONE0_CPU1PTEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU1PTEN */
#define IFX_MTU_MEMDONE0_CPU1PTEN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_OFF (10u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_OFF (11u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_MSK (0x1u)

