Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_OFF (20u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_OFF (22u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.ETHERMAC_DONE */
#define IFX_MTU_MEMDONE1_ETHERMAC_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.ETHERMAC_DONE */
#define IFX_MTU_MEMDONE1_ETHERMAC_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.ETHERMAC_DONE */
#define IFX_MTU_MEMDONE1_ETHERMAC_DONE_OFF (29u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN11_DONE */
#define IFX_MTU_MEMDONE1_MCAN11_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN11_DONE */
#define IFX_MTU_MEMDONE1_MCAN11_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN11_DONE */
#define IFX_MTU_MEMDONE1_MCAN11_DONE_OFF (31u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_MSK (0x1u)

