Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF1_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF1_DONE_OFF (5u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF1_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF1_DONE_OFF (7u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.HSPDM_RAM_DONE */
#define IFX_MTU_MEMDONE2_HSPDM_RAM_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT00_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT00_RAM_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT01_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT01_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT01_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT01_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT01_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT01_RAM_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT10_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT10_RAM_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT11_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT11_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT11_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT11_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT11_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT11_RAM_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT20_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT20_RAM_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT21_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT21_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT21_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT21_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT21_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT21_RAM_DONE_OFF (29u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT30_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT30_RAM_DONE_OFF (30u)

