Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SPU_FFT31_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT31_RAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SPU_FFT31_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT31_RAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SPU_FFT31_RAM_DONE */
#define IFX_MTU_MEMDONE2_SPU_FFT31_RAM_DONE_OFF (31u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DMEM_FDA_OFF (0u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_DTAG_FDA_OFF (1u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PMEM_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU0_PTAG_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2PCEN */
#define IFX_MTU_MEMFDA0_CPU2PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2PCEN */
#define IFX_MTU_MEMFDA0_CPU2PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2PCEN */
#define IFX_MTU_MEMFDA0_CPU2PCEN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DMEM_FDA_OFF (5u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DTAG_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_OFF (7u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_OFF (8u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_OFF (10u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU0PCEN */
#define IFX_MTU_MEMFDA0_CPU0PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU0PCEN */
#define IFX_MTU_MEMFDA0_CPU0PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU0PCEN */
#define IFX_MTU_MEMFDA0_CPU0PCEN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_LEN (1u)

