Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1PCEN */
#define IFX_MTU_MEMFDA0_CPU1PCEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1PCEN */
#define IFX_MTU_MEMFDA0_CPU1PCEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1PCEN */
#define IFX_MTU_MEMFDA0_CPU1PCEN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1PSEN */
#define IFX_MTU_MEMFDA0_CPU1PSEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1PSEN */
#define IFX_MTU_MEMFDA0_CPU1PSEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1PSEN */
#define IFX_MTU_MEMFDA0_CPU1PSEN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1PTEN */
#define IFX_MTU_MEMFDA0_CPU1PTEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1PTEN */
#define IFX_MTU_MEMFDA0_CPU1PTEN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1PTEN */
#define IFX_MTU_MEMFDA0_CPU1PTEN_OFF (21u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_OFF (23u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_OFF (24u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_OFF (25u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_OFF (26u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_OFF (27u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_OFF (10u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCDS_FDA */
#define IFX_MTU_MEMFDA1_MCDS_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM0_FDA */
#define IFX_MTU_MEMFDA1_EMEM0_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM2_FDA */
#define IFX_MTU_MEMFDA1_EMEM2_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM3_FDA */
#define IFX_MTU_MEMFDA1_EMEM3_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM3_FDA */
#define IFX_MTU_MEMFDA1_EMEM3_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM3_FDA */
#define IFX_MTU_MEMFDA1_EMEM3_FDA_OFF (15u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.EMEM_XTM_FDA */
#define IFX_MTU_MEMFDA1_EMEM_XTM_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER0_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER0_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER0_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER0_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER1_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER1_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SPU_BUFFER1_FDA */
#define IFX_MTU_MEMFDA1_SPU_BUFFER1_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SPU_CONFIG0_FDA */
#define IFX_MTU_MEMFDA1_SPU_CONFIG0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SPU_CONFIG0_FDA */
#define IFX_MTU_MEMFDA1_SPU_CONFIG0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SPU_CONFIG0_FDA */
#define IFX_MTU_MEMFDA1_SPU_CONFIG0_FDA_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SPU_CONFIG1_FDA */
#define IFX_MTU_MEMFDA1_SPU_CONFIG1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SPU_CONFIG1_FDA */
#define IFX_MTU_MEMFDA1_SPU_CONFIG1_FDA_MSK (0x1u)

