Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.HSPDM_RAM_FDA */
#define IFX_MTU_MEMFDA2_HSPDM_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.HSPDM_RAM_FDA */
#define IFX_MTU_MEMFDA2_HSPDM_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.HSPDM_RAM_FDA */
#define IFX_MTU_MEMFDA2_HSPDM_RAM_FDA_OFF (21u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT00_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT00_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT00_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT00_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT00_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT00_RAM_FDA_OFF (24u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT01_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT01_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT01_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT01_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT01_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT01_RAM_FDA_OFF (25u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT10_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT10_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT10_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT10_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT10_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT10_RAM_FDA_OFF (26u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT11_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT11_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT11_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT11_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT11_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT11_RAM_FDA_OFF (27u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT20_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT20_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT20_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT20_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT20_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT20_RAM_FDA_OFF (28u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT21_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT21_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT21_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT21_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT21_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT21_RAM_FDA_OFF (29u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT30_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT30_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT30_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT30_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT30_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT30_RAM_FDA_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SPU_FFT31_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT31_RAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SPU_FFT31_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT31_RAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SPU_FFT31_RAM_FDA */
#define IFX_MTU_MEMFDA2_SPU_FFT31_RAM_FDA_OFF (31u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN10 */
#define IFX_MTU_ACCEN0_EN10_LEN (1u)

