Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_MSK (0x0u)

/** \brief Offset for Ifx_MTU_MC_RANGE_Bits.RAEN */
#define IFX_MTU_MC_RANGE_RAEN_OFF (15u)

/** \brief Length for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_LEN (16u)

/** \brief Mask for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_MC_REVID_Bits.REV_ID */
#define IFX_MTU_MC_REVID_REV_ID_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.CENE */
#define IFX_MTU_MC_ECCS_CENE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.UENE */
#define IFX_MTU_MC_ECCS_UENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.UENE */
#define IFX_MTU_MC_ECCS_UENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.UENE */
#define IFX_MTU_MC_ECCS_UENE_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.AENE */
#define IFX_MTU_MC_ECCS_AENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.AENE */
#define IFX_MTU_MC_ECCS_AENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.AENE */
#define IFX_MTU_MC_ECCS_AENE_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_LEN (2u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_MSK (0x3u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_OFF (6u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_LEN (2u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_MSK (0x3u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_OFF (10u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.UERR */
#define IFX_MTU_MC_ECCD_UERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.UERR */
#define IFX_MTU_MC_ECCD_UERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.UERR */
#define IFX_MTU_MC_ECCD_UERR_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.AERR */
#define IFX_MTU_MC_ECCD_AERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.AERR */
#define IFX_MTU_MC_ECCD_AERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.AERR */
#define IFX_MTU_MC_ECCD_AERR_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_LEN (5u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_MSK (0x1fu)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_OFF (15u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_LEN (13u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_MSK (0x1fffu)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_LEN (3u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_MSK (0x7u)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_OFF (13u)

/** \brief Length for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_LEN (16u)

/** \brief Mask for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.CERR */
#define IFX_MTU_MC_ERRINFO_CERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.CERR */
#define IFX_MTU_MC_ERRINFO_CERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.CERR */
#define IFX_MTU_MC_ERRINFO_CERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.UERR */
#define IFX_MTU_MC_ERRINFO_UERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.UERR */
#define IFX_MTU_MC_ERRINFO_UERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.UERR */
#define IFX_MTU_MC_ERRINFO_UERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.AERR */
#define IFX_MTU_MC_ERRINFO_AERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.AERR */
#define IFX_MTU_MC_ERRINFO_AERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.AERR */
#define IFX_MTU_MC_ERRINFO_AERR_OFF (2u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMTU_BF_H */
